function CourseDescription({ data: name }) {
  const items = [
    {
      id: "whatis?",
      title: `${
        name === "htmlcss"
          ? "HmtlCss"
          : name === "javascript"
          ? "JavaScript"
          : name === "reactjs"
          ? "ReactJs"
          : name === "nextjs"
          ? "NextJs"
          : name === "tailwindcss"
          ? "TailwindCss"
          : name === "materialUi"
          ? "MaterialUi"
          : name === "github"
          ? "Git و Github"
          : "بوت کمپ صفر تا صد فرانت"
      } چیست؟`,
      description: `${
        name === "htmlcss"
          ? "Html و CSS دو مفهوم مجزا هستند. قدم اول در یادگیری برنامه نویسی، آموزش این دوره است؛ Html در واقع همان ساختار صفحات مختلف وبسایت یا نرم افزاری است که روی آن کار می کنیم؛ در حالیکه CSS به همین ساختاری که ایجاد کرده ایم رنگ و بو می بخشد."
          : name === "javascript"
          ? "زبان برنامه نویسی جاوااسکریپت، پرطرفدارترین زبان در حوزه وب و اپلیکیشن می باشد. جاوااسکریپت، منطق و فرایند ها را به وبسایت ما اضافه می کند. از این زبان هم در سمت فرانت و هم بک اند استفاده می شود. نکته مهم اینست که برای تبدیل شدن به یک فرد متخصص در برنامه نویسی، یادگیری عمیق Js بسیار حائز اهمیت است.، "
          : name === "reactjs"
          ? "در حال حاضر، در کمتر پروژه ای از جاوااسکریپت خام استفاده می شود. زبان JS دارای یکسری کتابخانه ها در سمت فرانت و بک اند است که پروژه های امروزی را به شدت تحت تاثیر قرار داده است. ری اکت از پرکاربردترین این کتابخانه ها در سمت فرانت می باشد. با آموزش صحیح ری اکت شما تقریباً 70 درصد مسیر یک متخصص فرانت را طی کرده اید."
          : name === "nextjs"
          ? "نکست، یک فریم وورک از ری اکت می باشد. با استفاده از ری اکت، متوجه می شویم که یکسری باگ های اساسی وجو دارد؛  مثل عدم توانایی لازم ری اکت در فرایند SEO. نکست جی اس، این سری از مشکلات ری اکت را از بین می برد؛ همچنین، پرفورمنس و سرعت وبسایت را به شدت بالا می برد."
          : name === "tailwindcss"
          ? "تیلویند، توسط شخصی به نام آدام واتان ساخته شد. استفاده از این فریم وورک CSS ای، باعث می شود هیچ فایل استایلی به پروژه اضافه نکنیم، حجم کل پروژه بسیار کاهش می یابد و سرعت کدزنی مارو افزایش می دهد."
          : name === "materialUi"
          ? "یادگیری متریال هم در کنار تیلویند به کمک می کند تا با استفاده از یکسری کامپوننت های آماده، سرعت کدزنی، کیفیت آن و همچنین پرفورمنس وبسایت دو چندان شود. تقریباً درصد بسیار زیادی از پروژه ها در سطح دنیا از متریال و تیلویند برای استایل دهی استفاده می کنند."
          : name === "github"
          ? "فرض کنید مدت هاست روی یک پروژه کار می کنید؛ به یکباره سیستم شما دچار اختلال می شود و کل فایل های پروژه از بین می رود، چه احساسی دارید؟ با استفاده از Git و Github این مشکل برطرف می شود و شما در هرکجا امکان دسترسی به سورس کد پروژه تون رو دارید. همچنین، در تیم های برنامه نویسی می بایست برای اینکه با تیم کار کنید حتماً از گیت و گیت هاب استفاده نمایید؛ چون قابلیت های بیشماری دارد."
          : "واژه بوت کمپ در ابتدا در ارتش آمریکا ایجاد شد و معنی آن قرارگیری در یک کمپ آموزشی با مدت معلوم و برنامه های تمرینی و نظارتی از پیش تعیین شده است. چندین سال است که این واژه به حوزه برنامه نویسی وارد شده است. در این بوت کمپ تمام آموزش ها از پایه در تا سطح ورود به بازار کار در اختیار شما قرار می گیرد. در این بوت کمپ ما به مدت 8 ماه در کنار شما هستیم تا بهترین نتایج رو بگیرید، پس از گذراندن این بوت کمپ، که تحت نظارت 24 ساعته تیم کَن آی کُد هستید، آمادگی لازم برای استخدام در شرکت های برنامه نویسی، امکان دریافت پروژه های فریلسنری و حتی امکان اسنخدام در آکادمی کَن آی کُد را دارید."
      } `,
    },
    {
      id: "why",
      title: `چرا دوره ${
        name === "htmlcss"
          ? "HmtlCss"
          : name === "javascript"
          ? "JavaScript"
          : name === "reactjs"
          ? "ReactJs"
          : name === "nextjs"
          ? "NextJs"
          : name === "tailwindcss"
          ? "TailwindCss"
          : name === "materialUi"
          ? "MaterialUi"
          : name === "github"
          ? "Git و Github"
          : "بوت کمپ صفر تا صد فرانت"
      }؟`,
      description: `${
        name === "htmlcss"
          ? "نقطه شروع مسیر برنامه نویس شدن همه برنامه نویس ها، بوده است. این دوره بهت کمک می کنه تا متوجه بشی که علاقه داری ادامه بدی یا نه؟"
          : name === "javascript"
          ? "پرطرفدارترین، پر کاربرد ترین و شاید بتونم بگم زیباترین زبان برنامه نویسی در دنیا هستش. وقتی جاوااسکریپت رو یاد گرفتم، تفکر منطقی و تحلیلی به کل تصمیمات زندگیم اضافه شد. "
          : name === "reactjs"
          ? "کدزنی رو برای ما راحت تر می کنه، فهم پروژه رو بسیار آسان تر می کند، سرعت وبسایت و پرفورمنس آن را به شدت بالاتر می بردو در نهایت باید بگم ری اکت هم در بین کتابخانه های فرانتی جاوااسکریپت، پرطرفدارترین و پرکاربرد ترین است. از دیگر کتابخانه های فرانتی جاوااسکریپت که طرفدار زیادی دارند می تونیم به vue.js و svelte هم اشاره کنیم."
          : name === "nextjs"
          ? "آموزش این فریم وورک ری اکتی، عملاً شما را به یک فول استک دولوپر تبدیل می کند. شما می توانید با استفاده از نکست، تمام فرایند های فرانت و بک اند پروژه تون را همزمان هندل کنید. افزایش پرفورمنس، افزایش سرعت کدزنی و کاهش چشمگیر حجم کد ها در کنار امکانات فوق العاده ای که نکست در مورد سئو توسعه دهندگی یک وبسایت به ما ارائه می کند؛ این فریم وورک را تبدیل به یک ابر قهرمان فرانت اند کرده است. هلدینک های زیادی در دنیا و در داخل کشور از این فریم وورک استفاده می کنند، مثل دیجیکالا"
          : name === "tailwindcss"
          ? "در ابتدای مسیر برنامه نویسی فرانت اند، متوجه خواهید شد که تعداد فایل های CSS یا همون استایل ها خیلی زیاد میشه. با استفاده از کلاس های تیلویند که یکی از قدرتمندترین و پرکاربردترین فریم وورک های استایل دهی در CSS هستش، عملکرد وبسایت ما و همچنین پرفورمنس خود برنامه نویس به شدت افزایش پیدا می کند."
          : name === "materialUi"
          ? "متریال یکسری کامپوننت های آماده دارد، مثل button ها، Link ها، فرم ها، اینپوت ها و خیلی کامپونن های دیگری که در پروژه وقت گیر هستند. با استفاده از این کامپوننت های آماده در بسیاری از مواقع، پروژه ما رنگ و لعاب بهتری هم می گیرد در کنار اینکه به سرعت کدزنی، افزایش بهره وری برنامه نویس کمک شایانی می کند."
          : name === "github"
          ? "تقریباً در هیچ کجا در دنیا، بدون استفاده از گیت و گیت هاب هیچ پروژه ای را استارت نمی زنند. گیتهاب در واقع یک Sourse Code Manager هست که به ما در نگهداری از کدها، نگهداری از ورژن های مختلف پروژه کمک  می کند. همچنین برای رزومه سازی باید از گیتهاب استفاده کرد."
          : "با حضور در این بوت کمپ شما طی 8 ماه برنامه نویسی فرانت اند رو آموزش می بینید. آموزش ها به صورت کامل در اختیار تمام کارآموزان قرار خواهد گرفت. آموزش ها طی یک فرایند مشخص و طی بازه های زمانی به شما داده می شوند. تمام کارآموزان با ما ارتباط تصویری خواهند داشت و تمام مسیر یادگیری شما در این بوت کمپ زیر ذره بین هستش تا بهترین نتیجه رو بگیرید؛ همچنین یکسری وبینارهای هفتگی داریم که لایو کد انجام میدیم و همه کارآموزان حضور دارند؛ در همین بوت کمپ شما حتی می توانید، تیم برنامه نویسی خودتون رو شکل بدید. "
      } `,
    },
  ];
  return (
    <div className="flex flex-col w-full justify-center items-center shadow-normal rounded-lg">
      CourseDescription
    </div>
  );
}

export default CourseDescription;
