//Components
import FAQAccordion from "../../../../elements/FAQAccordion";

//Images & Icons
import LaptopMacIcon from "@mui/icons-material/LaptopMac";
import WindowIcon from "@mui/icons-material/Window";
import AdbIcon from "@mui/icons-material/Adb";
import LanguageIcon from "@mui/icons-material/Language";

function CourseFAQ({ data: name }) {
  const FAQList = [
    {
      id: "suitable",
      question: "این دوره برای چه کسانی مناسب است؟",
      answer: `${
        name === "htmlcss"
          ? "این دوره برای کسانی مناسب است که تصمیم به شروع یادگیری برنامه نویسی گرفته اند و هیچ پیش زمینه ای در این حوزه ندارند."
          : name === "javascript"
          ? "این دوره برای کسانی که علاقه مند به حوزه برنامه نویسی وب و اپلیکیشن هستند و همچنین درک درستی از HTML و CSS دارند مناسب می باشد."
          : name === "reactjs"
          ? "از اونجاییکه ری اکت، یک لایبرری سمت فرانت از جاوااسکریپت هستش؛ این دوره برای کسانی است که می خواهند به عنوان برنامه نویس فرانت اند فعالیت کنند و همچنین درک عمیقی از جاوااسکریپت دارند. پیش نیاز این دوره، دانستن زبان جاوااسکریپت می باشد."
          : name === "nextjs"
          ? "یادگیری NextJs کاملاً به این بر می گردد که شما چقدر ری اکت را درک کرده اید. کسانیکه به توانایی خوبی در هندل کردن تسک ها توسط ری اکت رسیده اند؛ برای تبدیل شدن به یک متخصص ارشد فرانت این دوره به شدت پیشنهاد می شود."
          : name === "tailwindcss" && name === "materialUi"
          ? "استفاده از فریم وورک های CSS منوط به یادگیری ری اکت می باشد. کسانی که ری اکت را به خوبی آموزش دیده اند و تسلط کافی بر آن دارند می توانند در این دوره شرکت نمایند."
          : name === "github"
          ? "پس از یادگیری جاوااسکریپت، می توانید آموزش گیتهاب را شروع کنید. چون از این پس یکسری پروژه ها و مینی پروژه هارو قرار هست که باهم کار کنیم، که استفاده از گیتهاب باعث میشه همین پروژه ها به رزومه شما اضافه شود."
          : "این دوره برای کسانی که می خواهند خیلی منظم و در کمترین زمان ممکن از نقطه صفر به سطح متخصص ارشد فرانت اند  برسند بسیار مناسب است. در طول دوره بوت کمپ شما از نظارت 100 درصدی تیم پشتیبانی کَن آی کُد بهره مند هستید. ضمن اینکه شرکت در این دوره هیچ پیشنیازی ندارد و همچنین تمام آموزش ها به پنل کاربری شما اضافه خواهد شد."
      }`,
    },
    {
      id: "limitation",
      question: "آیا این دوره محدودیت ثبت نام دارد؟",
      answer: `${
        name !== "bootcamp"
          ? "خیر، شما به صورت کلی می توانید در هر زمان در این دوره شرکت کنید، اما در زمان جشنواره ها، دوره ظرفیت پذیرش محدود دارد با توجه به میزان تخفیفی که گذاشته شده است."
          : "با توجه به ظرفیت فعلی تیم پشتیبانی کَن آی کُد، محدودیت ثبت نام 30 نفره داریم. به این شکل که هر دو ماه فقط 30 نفر می توانند در بوت کمپ ثبت نام کنند. دلیل آن هم اینست که کیفیت پشتیبانی بوت کمپ اولویت آموزشی ماست."
      }`,
    },
    {
      id: "support",
      question: "نحوه پشتیبانی دوره به چه صورت است؟",
      answer:
        "پشتیبانی در روند آموزشی ما نسبت به هر فاکتور دیگری اولویت دارد. پشتیبانی کَن ای کُد به صورت دائمی است. شما در هر زمینه ای می تونید از طریق واتساپ و تلگرام پشتیبانی کَن ای کُد با ما در ارتباط باشید.",
    },
    {
      id: "course-update",
      question: "آیا این مباحث این دوره آپدیت می شوند؟",
      answer:
        "با توجه به سرعت چشمگیر پیشرفت حوزه های مختلف در برنامه نویسی، در صورتیکه در مباحث این کورس آموزشی به روز رسانی ای اتفاق بیافتد، در کوتاه ترین زمان مباحث آپدیت شده به این کورس اضافه می شوند.",
    },
    {
      id: "course-update-cost",
      question: "دسترسی به آپدیت های این دوره هزینه اضافه دارد؟",
      answer:
        "خیر، شما با شرکت در این دوره، دسترسی مادام العمر به کلیه مباحث دوره و آپدیت های آینده آن خواهید داشت.",
    },
    {
      id: "course-access",
      question: "چگونه به ویدئو ها دوره دسترسی داشته باشیم؟",
      answer:
        "پس از ثبت نام و خرید دوره، لایسنس اختصاصی جهت دسترسی به مباحث دوره در قسمت لایسنس های من در پنل کاربری شما به صورت خودکار قرار داده می شود. تمامی ویدئو های آموزشی ما توسط نرم افزار اسپات پلیر در اختیار کارآموزان قرار گرفته می شود. شما می توانید از طریق لینک های زیر نرم افزار اسپات پلیر را بر اساس نوع سیستم عامل خودتون نصب کنید. پس از نصب اسپات پلیر، کافیست لایسنس دوره رو داخل قسمت License جاگذاری کنید و روی Submit کلیک کنید.",
      spotPlayerLinks: [
        {
          id: "windows",
          title: "ویندوز",
          img: <WindowIcon fontSize="small" sx={{ color: "#fb7185" }} />,
          url: "https://app.spotplayer.ir/assets/bin/spotplayer/setup.exe",
        },
        {
          id: "android",
          title: "اندروید",
          img: <AdbIcon fontSize="small" sx={{ color: "#22c55e" }} />,
          url: "https://app.spotplayer.ir/assets/bin/spotplayer/setup.apk",
        },
        {
          id: "macos",
          title: "نسخه مک",
          img: <LaptopMacIcon fontSize="small" sx={{ color: "#475569" }} />,
          url: "https://app.spotplayer.ir/assets/bin/spotplayer/setup.dmg",
        },
        {
          id: "webapp",
          title: "نسخه وب",
          img: <LanguageIcon fontSize="small" sx={{ color: "#0ea5e9" }} />,
          url: "https://app.spotplayer.ir/",
        },
      ],
    },
    {
      id: "license",
      question: "منظور از لایسنس چیست؟",
      answer:
        "شما پس از خرید هر دوره آموزشی، یک لایسنس استفاده از دوره را در پنل کاربری دریافت می کنید. این لایسنس فقط و فقط روی یک دیوایس(دستگاه) قابل استفاده خواهد بود. این لایسنس فقط مخصوص شماست و هیچ فرد دیگری نمی تواند از آن استفاده کند.",
    },
  ];
  return (
    <div className="flex flex-col w-full mx-auto items-center justify-center">
      {FAQList.map((item) => (
        <FAQAccordion key={item.id} data={item} />
      ))}
    </div>
  );
}

export default CourseFAQ;
